micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_mdf.c
/**
  ******************************************************************************
  * @file    stm32n6xx_hal_mdf.c
  * @author  MCD Application Team
  * @brief   This file provides firmware functions to manage the following
  *          functionalities of the Multi-function Digital Filter (MDF)
  *          peripheral:
  *           + Initialization and de-initialization
  *           + Acquisition
  *           + Clock absence detection
  *           + Short circuit detection
  *           + Out-off limit detection
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
  [..]
    *** Initialization and de-initialization ***
    ============================================
    [..]
      (#) User has first to initialize MDF or ADF instance.
      (#) As prerequisite, fill in the HAL_MDF_MspInit() :
        (++) Enable MDFz or ADFz clock interface with __HAL_RCC_MDFz_CLK_ENABLE()
             or __HAL_RCC_ADFz_CLK_ENABLE().
        (++) Enable the clocks for the used GPIOS with __HAL_RCC_GPIOx_CLK_ENABLE().
        (++) Configure these pins in alternate mode using HAL_GPIO_Init().
        (++) If interrupt mode is used, enable and configure MDFz_FLTx or ADFz
             interrupt with HAL_NVIC_SetPriority() and HAL_NVIC_EnableIRQ().
        (++) If DMA mode is used, initialize and configure DMA.
      (#) Configure the common parameters (only for first MDF or ADF instance init),
          serial interface parameters and filter bitstream selection by calling
          HAL_MDF_Init() function.

    [..]
      (#) User can de-initialize MDF or ADF instance with HAL_MDF_DeInit() function.

    *** Acquisition ***
    ===================
    [..]
      (#) Configure filter parameters and start acquisition using HAL_MDF_AcqStart(),
          HAL_MDF_AcqStart_IT() or HAL_MDF_AcqStart_DMA().
      (#) In polling mode :
            (++) Use HAL_MDF_PollForAcq() to detect the end of acquisition.
                 Use HAL_MDF_GetAcqValue to get acquisition value.
            (++) Only for MDF instance, use HAL_MDF_PollForSnapshotAcq() to detect
                 the end of snapshot acquisition.
                 Use HAL_MDF_GetSnapshotAcqValue to get snapshot acquisition value.
            (++) Only for ADF instance, use HAL_MDF_PollForSndLvl() to detect and get
                 new sound level value and ambient noise value.
            (++) Only for ADF instance, use HAL_MDF_PollForSad() to detect sound activity.
      (#) In interrupt mode :
            (++) HAL_MDF_AcqCpltCallback() will be called at the end of acquisition.
                 Use HAL_MDF_GetAcqValue to get acquisition value or use
                 HAL_MDF_GetSnapshotAcqValue to get snapshot acquisition value.
            (++) Only for ADF instance, HAL_MDF_SndLvlCallback() will be called when new
                 sound level and ambient noise values are available.
            (++) Only for ADF instance, HAL_MDF_SadCallback() will be called when
                 sound activity detection occurs.
            (++) HAL_MDF_ErrorCallback() will be called if overflow, filter overrun or
                 saturation occurs.
                 Use HAL_MDF_GetErrorCode() to get the corresponding error.
      (#) In DMA mode :
            (++) HAL_MDF_AcqHalfCpltCallback() and HAL_MDF_AcqCpltCallback() will be called
                 respectively at the half acquisition and at the acquisition complete.
            (++) Only for ADF instance, HAL_MDF_SndLvlCallback() will be called when new
                 sound level and ambient noise values are available.
            (++) Only for ADF instance, HAL_MDF_SadCallback() will be called when
                 sound activity detection occurs.
            (++) HAL_MDF_ErrorCallback() will be called if overflow, filter overrun,
                 saturation or DMA error occurs.
                 Use HAL_MDF_GetErrorCode() to get the corresponding error.
      (#) Use HAL_MDF_GenerateTrgo() to generate pulse on TRGO signal.
      (#) During acquisition, use HAL_MDF_SetDelay() and HAL_MDF_GetDelay() to respectively
          set and get the delay on data source.
      (#) During acquisition, use HAL_MDF_SetGain() and HAL_MDF_GetGain() to respectively
          set and get the filter gain.
      (#) During acquisition, use HAL_MDF_SetOffset() and HAL_MDF_GetOffset() to respectively
          set and get the filter offset error compensation.
      (#) During acquisition, only for MDF instance, use HAL_MDF_SetOffset() and HAL_MDF_GetOffset()
          to respectively set and get the filter offset error compensation.
      (#) Stop acquisition using HAL_MDF_AcqStop(), HAL_MDF_AcqStop_IT() or HAL_MDF_AcqStop_DMA().

    *** Clock absence detection ***
    ===============================
    [..]
      (#) Clock absence detection is always enabled so no need to start clock absence detection
          in polling mode.
          Use HAL_MDF_CkabStart_IT() to start clock absence detection in interrupt mode.
      (#) In polling mode, use HAL_MDF_PollForCkab() to detect the clock absence.
      (#) In interrupt mode, HAL_MDF_ErrorCallback() will be called if clock absence detection
          occurs.
          Use HAL_MDF_GetErrorCode() to get the corresponding error.
      (#) Stop clock absence detection in interrupt mode using HAL_MDF_CkabStop_IT().

    *** Short circuit detection ***
    ===============================
    [..]
      (#) Only for MDF instance, start short circuit detection using HAL_MDF_ScdStart()
          or HAL_MDF_ScdStart_IT().
      (#) In polling mode, use HAL_MDF_PollForScd() to detect short circuit.
      (#) In interrupt mode, HAL_MDF_ErrorCallback() will be called if short circuit detection
          occurs.
          Use HAL_MDF_GetErrorCode() to get the corresponding error.
      (#) Stop short circuit detection using HAL_MDF_ScdStop() or HAL_MDF_ScdStop_IT().

