micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_mdf.c
    /* Wait for available acquisition value */
    while (((hmdf->Instance->DFLTISR & MDF_DFLTISR_RXNEF) != MDF_DFLTISR_RXNEF) && (status == HAL_OK))
    {
      /* Check the timeout */
      if (Timeout != HAL_MAX_DELAY)
      {
        if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
        {
          status = HAL_TIMEOUT;
        }
      }
    }

    /* Check if data overflow, saturation or reshape filter occurs */
    uint32_t error_flags = (hmdf->Instance->DFLTISR & (MDF_DFLTISR_DOVRF | MDF_DFLTISR_SATF | MDF_DFLTISR_RFOVRF));
    if (error_flags != 0U)
    {
      /* Update error code */
      if ((error_flags & MDF_DFLTISR_DOVRF) == MDF_DFLTISR_DOVRF)
      {
        hmdf->ErrorCode |= MDF_ERROR_ACQUISITION_OVERFLOW;
      }
      if ((error_flags & MDF_DFLTISR_SATF) == MDF_DFLTISR_SATF)
      {
        hmdf->ErrorCode |= MDF_ERROR_SATURATION;
      }
      if ((error_flags & MDF_DFLTISR_RFOVRF) == MDF_DFLTISR_RFOVRF)
      {
        hmdf->ErrorCode |= MDF_ERROR_RSF_OVERRUN;
      }

      /* Clear corresponding flags */
      hmdf->Instance->DFLTISR |= error_flags;

      /* Call error callback */
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
      hmdf->ErrorCallback(hmdf);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
      HAL_MDF_ErrorCallback(hmdf);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */
    }

    if (status == HAL_OK)
    {
      /* Update state only in asynchronous single shot mode */
      if ((hmdf->Instance->DFLTCR & MDF_DFLTCR_ACQMOD) == MDF_MODE_ASYNC_SINGLE)
      {
        hmdf->State = HAL_MDF_STATE_READY;
      }
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to poll for available snapshot acquisition value.
  * @param  hmdf MDF handle.
  * @param  Timeout Timeout value in milliseconds.
  * @retval HAL status.
  * @note   This function must not be used with ADF instance.
  */
HAL_StatusTypeDef HAL_MDF_PollForSnapshotAcq(MDF_HandleTypeDef *hmdf, uint32_t Timeout)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    status = HAL_ERROR;
  }
  else
  {
    uint32_t tickstart = HAL_GetTick();

    /* Wait for available snapshot acquisition value */
    while (((hmdf->Instance->DFLTISR & MDF_DFLTISR_SSDRF) != MDF_DFLTISR_SSDRF) && (status == HAL_OK))
    {
      /* Check the timeout */
      if (Timeout != HAL_MAX_DELAY)
      {
        if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
        {
          status = HAL_TIMEOUT;
        }
      }
    }

    /* Check if snapshot overrun, saturation or reshape filter occurs */
    uint32_t error_flags = (hmdf->Instance->DFLTISR & (MDF_DFLTISR_SSOVRF | MDF_DFLTISR_SATF | MDF_DFLTISR_RFOVRF));
    if (error_flags != 0U)
    {
      /* Update error code */
      if ((error_flags & MDF_DFLTISR_SSOVRF) == MDF_DFLTISR_SSOVRF)
      {
        hmdf->ErrorCode |= MDF_ERROR_ACQUISITION_OVERFLOW;
      }
      if ((error_flags & MDF_DFLTISR_SATF) == MDF_DFLTISR_SATF)
      {
        hmdf->ErrorCode |= MDF_ERROR_SATURATION;
      }
      if ((error_flags & MDF_DFLTISR_RFOVRF) == MDF_DFLTISR_RFOVRF)
      {
        hmdf->ErrorCode |= MDF_ERROR_RSF_OVERRUN;
      }

      /* Clear corresponding flags */
      hmdf->Instance->DFLTISR |= error_flags;

      /* Call error callback */
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
      hmdf->ErrorCallback(hmdf);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
      HAL_MDF_ErrorCallback(hmdf);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to get acquisition value.
  * @param  hmdf MDF handle.
  * @param  pValue Acquisition value on 24 MSB.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_GetAcqValue(const MDF_HandleTypeDef *hmdf, int32_t *pValue)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (pValue == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check state */
    if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
    {
      if (hmdf->State != HAL_MDF_STATE_READY)
      {
        status = HAL_ERROR;
      }
    }
  }

  if (status == HAL_OK)
  {
    /* Get acquisition value */
    *pValue = (int32_t) hmdf->Instance->DFLTDR;
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to get snapshot acquisition value.
  * @param  hmdf MDF handle.
  * @param  pSnapshotParam Snapshot parameters.
  * @retval HAL status.
  * @note   This function must not be used with ADF instance.
  */
HAL_StatusTypeDef HAL_MDF_GetSnapshotAcqValue(MDF_HandleTypeDef *hmdf, MDF_SnapshotParamTypeDef *pSnapshotParam)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (pSnapshotParam == NULL)
  {
    status = HAL_ERROR;
  }
  /* Check state */
  else if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    status = HAL_ERROR;
  }
  else
  {
    uint32_t snpsdr_value;

    /* Read value of snapshot data register */
    snpsdr_value = hmdf->Instance->SNPSDR;

    /* Clear snapshot data ready flag */
    hmdf->Instance->DFLTISR |= MDF_DFLTISR_SSDRF;

    /* Store value of decimation counter in snapshot parameter structure */
    pSnapshotParam->DecimationCounter = (snpsdr_value & MDF_SNPSDR_MCICDC);

    /* Check snapshot format */
    if ((hmdf->Instance->DFLTCR & MDF_SNAPSHOT_16BITS) == MDF_SNAPSHOT_16BITS)
    {
      /* Store value of integrator counter in snapshot parameter structure */
      pSnapshotParam->IntegratorCounter = ((snpsdr_value & MDF_SNPSDR_EXTSDR) >> MDF_SNPSDR_EXTSDR_Pos);

      /* Store snapshot acquisition value (16MSB) in snapshot parameter structure */
      snpsdr_value &= 0xFFFF0000U;
      pSnapshotParam->Value = (int32_t) snpsdr_value;
    }
    else
    {
      /* Store snapshot acquisition value (23MSB) in snapshot parameter structure */
      snpsdr_value &= 0xFFFFFE00U;
      pSnapshotParam->Value = (int32_t) snpsdr_value;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to stop acquisition in polling mode.
  * @param  hmdf MDF handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_AcqStop(MDF_HandleTypeDef *hmdf)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    /* Check if state is ready and filter active */
    if (hmdf->State == HAL_MDF_STATE_READY)
    {
      if ((hmdf->Instance->DFLTCR & MDF_DFLTCR_DFLTACTIVE) != MDF_DFLTCR_DFLTACTIVE)
      {
        status = HAL_ERROR;
      }
    }
    else
    {
      status = HAL_ERROR;
    }
  }
  else
  {
    /* Disable sound activity detector if needed for ADF instance */
    if (IS_ADF_INSTANCE(hmdf->Instance))
    {
      if ((hmdf->Instance->SADCR & MDF_SADCR_SADACTIVE) != 0U)
      {
        hmdf->Instance->SADCR &= ~(MDF_SADCR_SADEN);
      }
    }
  }

  if (status == HAL_OK)
  {
    /* Disable filter */
    hmdf->Instance->DFLTCR &= ~(MDF_DFLTCR_DFLTEN);

