micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_mdf.c
    /* Wait for clock absence detection */
    while (((hmdf->Instance->DFLTISR & MDF_DFLTISR_CKABF) != MDF_DFLTISR_CKABF) && (status == HAL_OK))
    {
      /* Check the timeout */
      if (Timeout != HAL_MAX_DELAY)
      {
        if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
        {
          status = HAL_TIMEOUT;
        }
      }
    }

    if (status == HAL_OK)
    {
      /* Clear clock absence detection flag */
      hmdf->Instance->DFLTISR |= MDF_DFLTISR_CKABF;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to start clock absence detection in interrupt mode.
  * @param  hmdf MDF handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_CkabStart_IT(MDF_HandleTypeDef *hmdf)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    if (hmdf->State != HAL_MDF_STATE_READY)
    {
      status = HAL_ERROR;
    }
  }

  if (status == HAL_OK)
  {
    /* Check serial interface status and mode */
    if ((hmdf->Instance->SITFCR & MDF_SITFCR_SITFACTIVE) == 0U)
    {
      status = HAL_ERROR;
    }
    else
    {
      if ((hmdf->Instance->SITFCR & MDF_SITFCR_SITFMOD) != MDF_SITF_NORMAL_SPI_MODE)
      {
        status = HAL_ERROR;
      }
    }
  }

  if (status == HAL_OK)
  {
    /* Clear clock absence detection flag */
    hmdf->Instance->DFLTISR |= MDF_DFLTISR_CKABF;

    /* Check clock absence detection flag */
    if ((hmdf->Instance->DFLTISR & MDF_DFLTISR_CKABF) == MDF_DFLTISR_CKABF)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Enable clock absence detection interrupt */
      hmdf->Instance->DFLTIER |= MDF_DFLTIER_CKABIE;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to stop clock absence detection in interrupt mode.
  * @param  hmdf MDF handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_CkabStop_IT(MDF_HandleTypeDef *hmdf)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    if (hmdf->State != HAL_MDF_STATE_READY)
    {
      status = HAL_ERROR;
    }
  }

  if (status == HAL_OK)
  {
    /* Check serial interface status and mode */
    if ((hmdf->Instance->SITFCR & MDF_SITFCR_SITFACTIVE) == 0U)
    {
      status = HAL_ERROR;
    }
    else
    {
      if ((hmdf->Instance->SITFCR & MDF_SITFCR_SITFMOD) != MDF_SITF_NORMAL_SPI_MODE)
      {
        status = HAL_ERROR;
      }
    }
  }

  if (status == HAL_OK)
  {
    /* Disable clock absence detection interrupt */
    hmdf->Instance->DFLTIER &= ~(MDF_DFLTIER_CKABIE);

    /* Clear potential pending clock absence detection flag */
    hmdf->Instance->DFLTISR |= MDF_DFLTISR_CKABF;
  }

  /* Return function status */
  return status;
}

/**
  * @}
  */

/** @defgroup MDF_Exported_Functions_Group4  Short circuit detection functions
  * @brief    Short circuit detection functions
  *
@verbatim
  ==============================================================================
                  ##### Short circuit detection functions #####
  ==============================================================================
    [..]  This section provides functions available only for MDF instance
          allowing to :
      (+) Start and stop short circuit detection in polling and interrupt mode.
      (+) Detect short circuit.
@endverbatim
  * @{
  */

/**
  * @brief  This function allows to start short-circuit detection in polling mode.
  * @param  hmdf MDF handle.
  * @param  pScdConfig Short-circuit detector configuration parameters.
  * @retval HAL status.
  * @note   This function must not be used with ADF instance.
  */
HAL_StatusTypeDef HAL_MDF_ScdStart(MDF_HandleTypeDef *hmdf, const MDF_ScdConfigTypeDef *pScdConfig)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (pScdConfig == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    assert_param(IS_MDF_INSTANCE(hmdf->Instance));
    assert_param(IS_MDF_SCD_THRESHOLD(pScdConfig->Threshold));
    assert_param(IS_MDF_BREAK_SIGNAL(pScdConfig->BreakSignal));

    /* Check state */
    if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
    {
      if (hmdf->State != HAL_MDF_STATE_READY)
      {
        status = HAL_ERROR;
      }
    }

    if (status == HAL_OK)
    {
      /* Check short-circuit detector status */
      if ((hmdf->Instance->SCDCR & MDF_SCDCR_SCDACTIVE) == MDF_SCDCR_SCDACTIVE)
      {
        status = HAL_ERROR;
      }
      else
      {
        /* Configure threshold and break signal */
        hmdf->Instance->SCDCR = (((pScdConfig->Threshold - 1U) << MDF_SCDCR_SCDT_Pos) |
                                 (pScdConfig->BreakSignal << MDF_SCDCR_BKSCD_Pos));

        /* Enable short-circuit detector */
        hmdf->Instance->SCDCR |= MDF_SCDCR_SCDEN;
      }
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to poll for the short-circuit detection.
  * @param  hmdf MDF handle.
  * @param  Timeout Timeout value in milliseconds.
  * @retval HAL status.
  * @note   This function must not be used with ADF instance.
  */
HAL_StatusTypeDef HAL_MDF_PollForScd(MDF_HandleTypeDef *hmdf, uint32_t Timeout)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  assert_param(IS_MDF_INSTANCE(hmdf->Instance));

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    if (hmdf->State != HAL_MDF_STATE_READY)
    {
      status = HAL_ERROR;
    }
  }

  if (status == HAL_OK)
  {
    /* Check short-circuit detector status */
    if ((hmdf->Instance->SCDCR & MDF_SCDCR_SCDACTIVE) != MDF_SCDCR_SCDACTIVE)
    {
      status = HAL_ERROR;
    }
    else
    {
      uint32_t tickstart = HAL_GetTick();

      /* Wait for short-circuit detection */
      while (((hmdf->Instance->DFLTISR & MDF_DFLTISR_SCDF) != MDF_DFLTISR_SCDF) && (status == HAL_OK))
      {
        /* Check the timeout */
        if (Timeout != HAL_MAX_DELAY)
        {
          if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
          {
            status = HAL_TIMEOUT;
          }
        }
      }

      if (status == HAL_OK)
      {
        /* Clear short-circuit detection flag */
        hmdf->Instance->DFLTISR |= MDF_DFLTISR_SCDF;
      }
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to stop short-circuit detection in polling mode.
  * @param  hmdf MDF handle.
  * @retval HAL status.
  * @note   This function must not be used with ADF instance.
  */
HAL_StatusTypeDef HAL_MDF_ScdStop(MDF_HandleTypeDef *hmdf)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  assert_param(IS_MDF_INSTANCE(hmdf->Instance));

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    if (hmdf->State != HAL_MDF_STATE_READY)
    {
      status = HAL_ERROR;
    }
  }

  if (status == HAL_OK)
  {
    /* Check short-circuit detector status */
    if ((hmdf->Instance->SCDCR & MDF_SCDCR_SCDACTIVE) != MDF_SCDCR_SCDACTIVE)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Disable short-circuit detection */
      hmdf->Instance->SCDCR &= ~(MDF_SCDCR_SCDEN);

